#### Terraform Plan Output
```
data.aws_ami.ubuntu: Reading...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # aws_key_pair.admin-ec2-ssh-key will be created
  + resource "aws_key_pair" "admin-ec2-ssh-key" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "thesis-backend-instance-key"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + key_type        = (known after apply)
      + public_key      = (known after apply)
      + tags            = {
          + "Belong"    = "task-6-1"
          + "CreatedBy" = "Terraform"
        }
      + tags_all        = {
          + "Belong"    = "task-6-1"
          + "CreatedBy" = "Terraform"
        }
    }

  # aws_security_group.thesis-backend-instance will be created
  + resource "aws_security_group" "thesis-backend-instance" {
      + arn                    = (known after apply)
      + description            = "Security group for thesis backend instance"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow SSH from anywhere"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
          + {
              + cidr_blocks      = [
                  + "172.16.0.0/16",
                ]
              + description      = "Allow All TCP traffic from port 3000"
              + from_port        = 3000
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 3000
            },
        ]
      + name                   = "thesis-backend-instance"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Belong"    = "task-6-1"
          + "CreatedBy" = "Terraform"
        }
      + tags_all               = {
          + "Belong"    = "task-6-1"
          + "CreatedBy" = "Terraform"
        }
      + vpc_id                 = (known after apply)
    }

  # local_file.private_key will be created
  + resource "local_file" "private_key" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "400"
      + filename             = "./thesis-backend-instance-key.pem"
      + id                   = (known after apply)
    }

  # tls_private_key.admin-ec2-ssh-key will be created
  + resource "tls_private_key" "admin-ec2-ssh-key" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 4096
    }

  # module.thesis-vpc.aws_default_route_table.default[0] will be created
  + resource "aws_default_route_table" "default" {
      + arn                    = (known after apply)
      + default_route_table_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + route                  = (known after apply)
      + tags                   = {
          + "Belong"    = "task-6-1"
          + "CreatedBy" = "Terraform"
          + "Name"      = "task-6-1-default"
        }
      + tags_all               = {
          + "Belong"    = "task-6-1"
          + "CreatedBy" = "Terraform"
          + "Name"      = "task-6-1-default"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "5m"
          + update = "5m"
        }
    }

  # module.thesis-vpc.aws_default_security_group.this[0] will be created
  + resource "aws_default_security_group" "this" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Belong"    = "task-6-1"
          + "CreatedBy" = "Terraform"
          + "Name"      = "task-6-1-default"
        }
      + tags_all               = {
          + "Belong"    = "task-6-1"
          + "CreatedBy" = "Terraform"
          + "Name"      = "task-6-1-default"
        }
      + vpc_id                 = (known after apply)
    }

  # module.thesis-vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Belong"    = "task-6-1"
          + "CreatedBy" = "Terraform"
          + "Name"      = "task-6-1"
        }
      + tags_all = {
          + "Belong"    = "task-6-1"
          + "CreatedBy" = "Terraform"
          + "Name"      = "task-6-1"
        }
      + vpc_id   = (known after apply)
    }

  # module.thesis-vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.thesis-vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Belong"    = "task-6-1"
          + "CreatedBy" = "Terraform"
          + "Name"      = "task-6-1-public"
        }
      + tags_all         = {
          + "Belong"    = "task-6-1"
          + "CreatedBy" = "Terraform"
          + "Name"      = "task-6-1-public"
        }
      + vpc_id           = (known after apply)
    }

  # module.thesis-vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.thesis-vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.thesis-vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.16.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Belong"    = "task-6-1"
          + "CreatedBy" = "Terraform"
          + "Name"      = "task-6-1-public-ap-northeast-1a"
        }
      + tags_all                                       = {
          + "Belong"    = "task-6-1"
          + "CreatedBy" = "Terraform"
          + "Name"      = "task-6-1-public-ap-northeast-1a"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.thesis-vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.16.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Belong"    = "task-6-1"
          + "CreatedBy" = "Terraform"
          + "Name"      = "task-6-1-public-ap-northeast-1c"
        }
      + tags_all                                       = {
          + "Belong"    = "task-6-1"
          + "CreatedBy" = "Terraform"
          + "Name"      = "task-6-1-public-ap-northeast-1c"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.thesis-vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "172.16.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Belong"    = "task-6-1"
          + "CreatedBy" = "Terraform"
          + "Name"      = "task-6-1"
        }
      + tags_all                             = {
          + "Belong"    = "task-6-1"
          + "CreatedBy" = "Terraform"
          + "Name"      = "task-6-1"
        }
    }

Plan: 14 to add, 0 to change, 0 to destroy.

```
#### Errors
```

Error: reading EC2 AMIs: UnauthorizedOperation: You are not authorized to perform this operation. User: arn:aws:iam::979295895093:user/github-action is not authorized to perform: ec2:DescribeImages because no identity-based policy allows the ec2:DescribeImages action
	status code: 403, request id: fbae8199-bcd1-4693-91ba-6af665bf55b5

  with data.aws_ami.ubuntu,
  on compute.tf line 2, in data "aws_ami" "ubuntu":
   2: data "aws_ami" "ubuntu" {


```